nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/bubble_peripheral/pin_mux.c
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.0
processor: MC56F80748
package_id: MC56F80748VLH
mcu_data: ksdk2_0
processor_version: 0.13.4
board: MC56F80000-EVK
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_sim.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: QSCI0, signal: RXD, pin_signal: GPIOC3/TA0/CMPA_O/RXD0/CLKIN1}
  - {pin_num: '5', peripheral: QSCI0, signal: TXD, pin_signal: GPIOC2/TXD0/XB_OUT11/XB_IN2/CLKO0}
  - {pin_num: '3', peripheral: OCCS, signal: EXTAL, pin_signal: GPIOC0/EXTAL/CLKIN0}
  - {pin_num: '4', peripheral: OCCS, signal: XTAL, pin_signal: GPIOC1/XTAL}
  - {pin_num: '39', peripheral: GPIOF, signal: 'GPIO, 2', pin_signal: GPIOF2/ANA4a/XB_OUT6/LP_SDA0, direction: INPUT, open_drain: enable, pull_enable: enable}
  - {pin_num: '40', peripheral: GPIOF, signal: 'GPIO, 3', pin_signal: GPIOF3/ANB4a/XB_OUT7/LP_SCL0, direction: OUTPUT, gpio_init_state: 'true', open_drain: enable,
    pull_enable: enable}
  - {pin_num: '58', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/ANB4f/PWMA_3X/XB_IN2, identifier: LED_RED, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/XB_OUT10/PWMA_2X, identifier: WAKE_UP, direction: OUTPUT, gpio_init_state: 'true',
    open_drain: enable, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_TXD0_GPIO, BOARD_Boot_TXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC2 (pin 5) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C2_TXD0);
    /* Enable peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMode(BOARD_Boot_RXD0_GPIO, BOARD_Boot_RXD0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC3 (pin 7) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C3_RXD0);
    /* GPIO functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF2 (pin 39)  */
    GPIO_PinSetDirection(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SDA0_GPIO, BOARD_LP_SDA0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF8 (pin 6) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Initialize GPIO functionality on pin GPIOF3 (pin 40)  */
    GPIO_PinWrite(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LP_SCL0_GPIO, BOARD_LP_SCL0_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 58)  */
    GPIO_PinWrite(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LED_RED_GPIO, BOARD_LED_RED_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinWrite(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_WAKE_UP_GPIO, BOARD_WAKE_UP_PIN_MASK, kGPIO_DigitalOutput);

    /* Internal Peripheral Select */
    /* Select SCI0_RXD Input.: Select SCI0_RXD Input, GPIOC3 or GPIOC8 or GPIOF8. */
    SIM_SetInternalPeriInput(SIM, kSIM_SCI0_RXDInputIndex, kSIM_SCI0_RXDInput_GPIOC3_GPIOC8_GPIOF8);


    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_MASK)))

                  /* Pull Resistor Enable Bits: 0x010Cu. */
                  | GPIO_PUR_PU(0x010Cu));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Accel_InitPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '40', peripheral: LPI2C0, signal: SCL, pin_signal: GPIOF3/ANB4a/XB_OUT7/LP_SCL0, open_drain: enable, pull_enable: enable}
  - {pin_num: '39', peripheral: LPI2C0, signal: SDA, pin_signal: GPIOF2/ANA4a/XB_OUT6/LP_SDA0, open_drain: enable, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : Accel_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void Accel_InitPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* Enable peripheral functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMode(ACCEL_INITPINS_LP_SDA0_GPIO, ACCEL_INITPINS_LP_SDA0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF2 (pin 39) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F2_LP_SDA0);
    /* Enable peripheral functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMode(ACCEL_INITPINS_LP_SCL0_GPIO, ACCEL_INITPINS_LP_SCL0_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF3 (pin 40) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F3_LP_SCL0);

    /* Pin configuration on GPIOF2 (pin 39) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(ACCEL_INITPINS_LP_SDA0_GPIO, ACCEL_INITPINS_LP_SDA0_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 40) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(ACCEL_INITPINS_LP_SCL0_GPIO, ACCEL_INITPINS_LP_SCL0_PIN_MASK, kGPIO_OutputOpenDrain);

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_MASK)))

                  /* Pull Resistor Enable Bits: 0x0Cu. */
                  | GPIO_PUR_PU(0x0Cu));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/

